** set scroll screen
   #+begin_src emacs-lisp
     (setq scroll-step 1)
     (setq scroll-margin 1)
     (setq scroll-conservatively 100000)
   #+end_src

   #+RESULTS:
   : 100000

** configuration for smerge-mode
   #+begin_src emacs-lisp
     (setq smerge-command-prefix "\C-cv")
   #+end_src

   #+RESULTS:
   : v
   
*** Flycheck
    #+BEGIN_SRC emacs-lisp
      (use-package flycheck
	:defer 2
	:ensure t)
    #+END_SRC

    #+RESULTS:
    | flycheck-yamllint-setup | flycheck-mode-set-explicitly |

*** interface
    #+begin_src emacs-lisp
      (setq js-indent-level 2)
      (setq typescript-indent-level 2)
    #+end_src

    #+RESULTS:
    : 2
*** web-mode for vue.js 
   #+BEGIN_SRC emacs-lisp
     (defun my/web-vue-setup()
       "Setup for js related."
       (message "web-mode use vue related setup")
       (require 'company-css)
       (setq-local company-backends (append '(company-web-html company-css) company-backends))
       ;; (setup-tide-mode)
       ;; (prettier-js-mode)
       (flycheck-add-mode 'javascript-eslint 'web-mode)
       (flycheck-select-checker 'javascript-eslint)
       (my/use-eslint-from-node-modules))

     (use-package web-mode
       :ensure t
       :mode ("\\.html\\'" "\\.vue\\'")
       :config
       (setq web-mode-markup-indent-offset 2)
       (setq web-mode-css-indent-offset 2)
       (setq web-mode-code-indent-offset 2)
       (setq web-mode-enable-current-element-highlight t)
       (setq web-mode-enable-css-colorization t)
       (set-face-attribute 'web-mode-html-tag-face nil :foreground "royalblue")
       (set-face-attribute 'web-mode-html-attr-name-face nil :foreground "powderblue")
       (set-face-attribute 'web-mode-doctype-face nil :foreground "lightskyblue")
       (setq web-mode-content-types-alist
	     '(("vue" . "\\.vue\\'")))
       (use-package company-web
	 :ensure t)
       (add-hook 'web-mode-hook (lambda()
				  (cond ((equal web-mode-content-type "html")
					 (my/web-html-setup))
					((member web-mode-content-type '("vue"))
					 (my/web-vue-setup))))))


     (defun my/use-eslint-from-node-modules ()
       "Use local eslint from node_modules before global."
       (let* ((root (locate-dominating-file
		     (or (buffer-file-name) default-directory)
		     "node_modules"))
	      (eslint (and root
			   (expand-file-name "node_modules/eslint/bin/eslint.js"
					     root))))
	 (when (and eslint (file-executable-p eslint))
	   (setq-local flycheck-javascript-eslint-executable eslint))))
     (add-hook 'flycheck-mode-hook #'my/use-eslint-from-node-modules)
   #+END_SRC

   #+RESULTS:
   | my/use-eslint-from-node-modules | flycheck-yamllint-setup | flycheck-mode-set-explicitly |


** go programming
   * [[https://www.digitalocean.com/community/tutorials/how-to-install-go-on-ubuntu-18-04][How To Install Go on Ubuntu 18.04]]
   * go-mode with ob-go
     #+begin_src emacs-lisp
       (use-package go-mode
	 :ensure t
	 :config
	 (progn
	   (add-to-list 'auto-mode-alist '("\\.go\\'" . go-mode))
	   (if (string-equal system-type "gnu/linux")
	       (add-to-list 'exec-path "/usr/local/go/bin")
	     nil)
    
	   (use-package ob-go
	     :ensure t
	     :config
	     (add-to-list 'org-structure-template-alist '("go" . "src go"))
	     (org-babel-do-load-languages
	      'org-babel-load-languages
	      '((go . t))))))
     #+end_src

     #+RESULTS:
   * Test go example
     #+begin_src go :imports "fmt"
       fmt.Println("Hello, 世界")
     #+end_src

     #+RESULTS:
     : Hello, 世界


** org-agenda-files
   In case some org files is not listed in agenda files, run the code block again to refresh the file list.
   Another way is to invoke the function ~org-agenda-file-to-front~.
   #+begin_src emacs-lisp
     ;; make org-agenda to search all the TODOs recursively for files .org in folder "~/code/org/"
     (setq org-agenda-files (directory-files-recursively "~/code/org/" "\\.org$"))
   #+end_src

   #+RESULTS:
   | /home/zw/code/org/kubernetes/use-kubernetes-api.org | /home/zw/code/org/blog-creation.org | /home/zw/code/org/chez-scheme.org | /home/zw/code/org/clojure.org | /home/zw/code/org/emacs.org | /home/zw/code/org/home.org | /home/zw/code/org/learning_statistics_using_R.org | /home/zw/code/org/personal.org | /home/zw/code/org/work.org |

*** org-capture
    * create corresponding .org file within the org folder inside HUGO site
    * each note/post will be inserted into the corresponding org file under second level headline (the first level is the corresponding file headline)
    * edit config/menus.toml, create link to section
    * edit content/home/<corresponding url name>.md, use computer-science.md as example:
      * line 3: # This section displays recent blog posts from `content/computer-science/`.
      * title = "Computer Science Posts"
      * line 15: page_type = "computer-science"
    * Note: need to mark the second level headline status as DONE to make it be visiable and searchable after being published.
    
    configuration for ~org-capture~
    #+begin_src emacs-lisp
      (defun org-hugo-new-subtree-post-capture-template ()
	"Returns `org-capture' template string for new Hugo post.
      See `org-capture-templates' for more information."
	(let* (;; http://www.holgerschurig.de/en/emacs-blog-from-org-to-hugo/
	       (date (format-time-string (org-time-stamp-format  :inactive) (org-current-time)))
	       (title (read-from-minibuffer "Post Title: ")) ;Prompt to enter the post title
	       (fname (org-hugo-slug title)))
	  (mapconcat #'identity
		     `(
		       ,(concat "* TODO " title)
		       ":PROPERTIES:"
		       ,(concat ":EXPORT_FILE_NAME: " fname)
		       ,(concat ":EXPORT_DATE: " date) ;Enter current date and time
		       ,(concat ":EXPORT_HUGO_CUSTOM_FRONT_MATTER+: "  ":foo bar :baz zoo :alpha 1 :beta \"two words\" :gamma 10" )
		       ":END:"
		       "%?\n")          ;Place th
		     "\n")))

      (setq org-capture-templates
	    '(
	      ("t" "todo" entry (file "~/code/my-site/content-org/todo.org")
	       "* TODO %? :TODO: \n Added:%T\n"
	       :clock-in t :clock-resume t)

	      ("h" "Hugo post")

	      ("hc" "Computer-Science"
	       entry (file+olp "~/code/my-site/content-org/computer-science.org" "Computer-Science")
	       (function org-hugo-new-subtree-post-capture-template)
	       :clock-in t :clock-resume t)

	      ("hm" "Mathematics"
	       entry (file+olp "~/code/my-site/content-org/mathematics.org" "Mathematics")
	       (function org-hugo-new-subtree-post-capture-template)
	       :clock-in t :clock-resume t)

	      ("hs" "Software-Engineering"
	       entry (file+olp "~/code/my-site/content-org/software-engineering.org" "Software-Engineering")
	       (function org-hugo-new-subtree-post-capture-template)
	       :clock-in t :clock-resume t)

	      ("ht" "Tools"
	       entry (file+olp "~/code/my-site/content-org/tools.org" "Tools")
	       (function org-hugo-new-subtree-post-capture-template)
	       :clock-in t :clock-resume t)))
    #+end_src

    #+RESULTS:
    | t | todo | entry | (file ~/code/my-site/org/todo.org) | * TODO %? :TODO: |

** Set the background of org-exported <code> blocks according to theme
   #+begin_src emacs-lisp
     (defun my/org-inline-css-hook (exporter)
       "Insert custom inline css to automatically set the
     background of code to whatever theme I'm using's background"
       (when (eq exporter 'html)
	 (let* ((my-pre-bg (face-background 'default))
		(my-pre-fg (face-foreground 'default)))
	   (setq
	    org-html-head-extra
	    (concat
	     org-html-head-extra
	     (format "<style type=\"text/css\">\n pre.src {background-color: %s; color: %s;}</style>\n"
		     my-pre-bg my-pre-fg))))))

     (add-hook 'org-export-before-processing-hook 'my/org-inline-css-hook)
   #+end_src

   #+RESULTS:
   | my/org-inline-css-hook |

